// Задача 2: Напишите программу замена элементов массива: положительные элементы замените 
//на соответствующие отрицательные, и наоборот.
//1. Задаём  массив который нам нравится.
//2. Метод - поиска положительных элементов и отрицательных 
//
//
int A = -5;
int B = 5;
Console.WriteLine($"{A}..{B}");
