//  Задайте массив заполненный случайными положительными трёхзначными числами. 
//  Напишите программу, которая покажет количество чётных чисел в массиве.

Console.Write("Введите любое число эллементов массива: ");
int enterNumber = Convert.ToInt32(Console.ReadLine());
int[] array = new int 
