// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int A = -1;
int B = -3;
if (A > B)
{
Console.WriteLine("A = max B = min");
}
else
{
Console.WriteLine("A = min B = max");
}
