// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
int A = 4;










Console.WriteLine("Hello, World!");
